nxp-mcuxpresso/mcuxsdk-middleware-bluetooth-controller/src/hadm/kw47_mcxw72x_nbu/lcl_hadm_measurement.c
    /* Program RSM to start on NBU trigger + DELAY ahead of time */
    LCL_HAL_PROGRAM_RSM_TRIGGER(rsm_config_p->trig_sel, rsm_config_p->trig_delay);
    
    hadm_meas_p->state = HADM_HAL_MEAS_STATE_CONFIGURED;
    
    DEBUG_PIN1_CLR
    DEBUG_PIN0_CLR
      
    return HADM_HAL_SUCCESS;
    
config_error:

    assert(0);
    return HADM_HAL_FAIL;
}

BLE_HADM_STATUS_t lcl_hadm_run_measurement(const BLE_HADM_SubeventConfig_t *hadm_config_p)
{
    BLE_HADM_STATUS_t hal_status = HADM_HAL_SUCCESS;
    xcvrLclStatus_t status;

    hadm_meas_t *hadm_meas_p = lcl_hadm_get_meas_instance(hadm_config_p);
    hadm_proc_t *hadm_proc = &hadm_procs[hadm_config_p->connIdx];
    xcvr_lcl_rsm_config_t *rsm_config_p = &hadm_meas_p->rsm_config;
    uint32_t rsm_state;
       
    DEBUG_PIN0_SET
      
#ifdef UT_HADM_TRIGGER
    /* RSM should have started on NBU trigger and be in DELAY state */
    rsm_state = LCL_HAL_XCVR_GET_RSM_STATE;
    assert(rsm_state != LCL_HAL_XCVR_RSM_STATE_IDLE);
#endif

    /* At this point, the config must be valid and the procedure must have been initialized */
    if ((hadm_meas_p->state != HADM_HAL_MEAS_STATE_CONFIGURED) || (!hadm_proc->is_proc_init_done))
    {
        assert(false);
        return HADM_HAL_INVALID_ARGS;
    }
    
    /* Alloc result buffer */
    hadm_meas_p->result_p = lcl_hadm_utils_get_result_buffer();
    if (hadm_meas_p->result_p == NULL)
    {
        assert(false);
        return HADM_HAL_MEMORY_FULL;
    }
    
    DEBUG_PIN1_SET
      
    hadm_device.active_meas_p = hadm_meas_p; /* becomes active measurement */
    hadm_meas_p->state = HADM_HAL_MEAS_STATE_RUNNING;
        
    hadm_meas_p->result_p->connIdx = hadm_config_p->connIdx;
    hadm_meas_p->result_p->subeventIdx = hadm_config_p->subeventIdx; /* echo subeventIdx */
    hadm_meas_p->result_p->syncDelayUs = 0;

    DEBUG_PIN1_PULSE
      
    lcl_hadm_measurement_setup(hadm_proc, hadm_meas_p, hadm_config_p);
    
    DEBUG_PIN1_PULSE
    
    /* Configure Antenna switching */
    lcl_hadm_utils_configure_antenna_switching(hadm_meas_p);
    /* Configure TQI and start LCL if needed */
    if (rsm_config_p->op_mode != XCVR_RSM_SQTE_STABLE_PHASE_TEST_MODE)
    {
       if ((hadm_meas_p->debug_flags & HADM_DBG_FLG_AVG_OFF) == 0)
       {
            lcl_hal_xcvr_program_tqi(hadm_meas_p);
       }
       LCL_HAL_START_LCL;
    }
    
    DEBUG_PIN1_PULSE

    /* Start DMA if needed */
#ifndef RSM_DBG_IQ
    if ((hadm_meas_p->debug_flags & HADM_DBG_FLG_IQ_DMA) && ((hadm_meas_p->iq_buff_size > 0) || (hadm_meas_p->iq_buff_size_mode0 > 0)))
    {
        lcl_hal_xcvr_configure_dma_capture(LCL_START_DMA_ON_RSM_TRIGGER, 0, hadm_meas_p->iq_buff_size + hadm_meas_p->iq_buff_size_mode0, hadm_device.dma_debug_buff_size, hadm_device.dma_debug_buff_address);
        LCL_HAL_START_DMA(LCL_DMA_PAGE_RXDIGIQ);
    }
#else
    LCL_HAL_SET_IQ_CAPTURE_POINT(LCL_OUT_CH_FILTER_SEL);
    LCL_HAL_CLEAR_DMA_MASK_AND_AVG_WIN;
    lcl_hal_xcvr_configure_dma_capture(LCL_START_DMA_ON_TSM_RX_DIG_EN, 0, 0x2000, hadm_device.dma_debug_buff_size, hadm_device.dma_debug_buff_address);
    LCL_HAL_START_DMA(LCL_DMA_PAGE_RXDIGIQ);
#endif

    DEBUG_PIN1_PULSE

    /* Configure RSM block. Will start on NBU HW trigger */
    status = XCVR_LCL_RsmInit(rsm_config_p);    
    status += XCVR_LCL_Set_TSM_FastStart(rsm_config_p->role, rsm_config_p);
    if (hadm_config_p->phaseCont != HADM_PHASE_CONT_DISABLED)
    {
        XCVR_LCL_EnaLpmClkSwitch(1);
        XCVR_LCL_EnaDividerSync(true);
    }
    assert(gXcvrLclStatusSuccess == status);
      
    LCL_HAL_ENABLE_TONE_OBS

    DEBUG_PIN1_PULSE

    /* Configure PKT RAM circular buffers to be used by RSM */
    lcl_hal_pkt_ram_config_circ_buffers(&hadm_meas_p->pkt_ram);
    
#ifdef SIMULATOR
     status +=  SIMU_LCL_RsmGo(rsm_config_p->role, rsm_config_p);
#else
    rsm_state = LCL_HAL_XCVR_GET_RSM_STATE;
    assert(rsm_state == LCL_HAL_XCVR_RSM_STATE_DELAY);
    (void)rsm_state;
#endif

    DEBUG_PIN1_CLR
    DEBUG_PIN0_CLR

    return hal_status;
}

/* Stop one subevent */
void lcl_hadm_stop_measurement(const BLE_HADM_SubeventConfig_t *config)
{
    DEBUG_PIN0_SET
    
    hadm_meas_t *hadm_meas_p = lcl_hadm_get_meas_instance(config);
    assert(hadm_meas_p != NULL);
    assert(hadm_meas_p->state != HADM_HAL_MEAS_STATE_IDLE);


    if (hadm_meas_p->state == HADM_HAL_MEAS_STATE_RUNNING)
    {
        hadm_meas_p->state = HADM_HAL_MEAS_STATE_ABORTING;
        /* Abort RSM, this will set ABORT flag, trigger EOS IRQ, wait for RSM to switch to IDLE */
        XCVR_LCL_RsmStopAbort(TRUE);
        /* Note: Various buffers will be freed as part of regular RSM EOS/Abort code path */
    }
    else
    {
        /* Just free config buffer */
        BLE_HADM_ReleaseConfigBuffer((BLE_HADM_SubeventConfig_t **)&hadm_meas_p->config_p);
    }

    if (config->typeFlags & HADM_SUBEVT_LAST)
    {
        /* End of procedure, clean context */
        hadm_procs[config->connIdx].is_proc_init_done = false;
    }

    DEBUG_PIN0_CLR
}

/* Stop a whole procedure */
void lcl_hadm_stop_procedure(uint8 connIdx)
{
    DEBUG_PIN0_SET
    
    hadm_meas_t *hadm_meas_p = hadm_device.active_meas_p;
    if (hadm_meas_p != NULL)
    {
        /* we have a subevent in HADM_HAL_MEAS_STATE_RUNNING state on the connIdx beeing shut down */
        if (hadm_meas_p->config_p->connIdx == connIdx)
        {
            hadm_meas_p->state = HADM_HAL_MEAS_STATE_ABORTING;
            /* Abort RSM, this will set ABORT flag, trigger EOS IRQ, wait for RSM to switch to IDLE */
            XCVR_LCL_RsmStopAbort(TRUE);
            /* Note: Various buffers will be freed as part of regular RSM EOS/Abort code path */
        }
    }
    else
    {
        /* Config has been created, but no subevent running yet */
        lcl_hadm_utils_free_config_buffer(connIdx);
    }

    /* End of procedure, clean context */
    hadm_procs[connIdx].is_proc_init_done = false;
    
    DEBUG_PIN0_CLR
}

/* === Implementation (static) ============================================= */

static void lcl_hadm_measurement_setup(hadm_proc_t *hadm_proc, hadm_meas_t *hadm_meas_p, const BLE_HADM_SubeventConfig_t *hadm_config)
{
#ifndef SIMULATOR
    lcl_hal_xcvr_hadm_init(hadm_meas_p, hadm_config);
#ifdef HADM_CFO_COMP_PER_STEP_VIA_FOM
    if (hadm_config->role == HADM_ROLE_INITIATOR)
    {
        /* In this mode, an additional per-step IRQ is setup with higher priority than RSM IRQ, in order to program CFO via Fast Override Module */
        lcl_hadm_enable_interrupts_for_subevent();
        /* FOM override occurs on fom_tx/tx_en which happens before TSM raises the IT, so will apply to the next step. */
        LCL_HAL_SET_PLL_OFFSET_FO_ENTRY();
    }
#endif /* HADM_CFO_COMP_PER_STEP_VIA_FOM */
#endif /* SIMULATOR */
}

static void lcl_hadm_measurement_teardown(const BLE_HADM_SubeventConfig_t *hadm_config)
{
    lcl_hal_xcvr_hadm_deinit(hadm_config);
#ifdef HADM_CFO_COMP_PER_STEP_VIA_FOM
    if (hadm_config->role == HADM_ROLE_INITIATOR)
    {
        lcl_hadm_restore_interrupts_for_subevent();
    }
#endif /* HADM_CFO_COMP_PER_STEP_VIA_FOM */
}

