nxp-mcuxpresso/mcuxsdk-middleware-bluetooth-controller/src/hadm/kw47_mcxw72x_nbu/lcl_hadm_measurement.c
    DEBUG_PIN1_CLR
          
    return HADM_HAL_SUCCESS;
}

/*!
 * This function is used to perform specific actions on last mode 0 reception:
 * - lock AGC
 * - Compute ppm (CFO)
 */
static BLE_HADM_STATUS_t lcl_hadm_handle_last_mode0(hadm_meas_t *hadm_meas_p)
{
    uint32_t step_idx;
    BLE_HADM_Chan_Mode_PmExt_AntPerm_t *step_config_p = &hadm_meas_p->config_p->chModePmAntMap[0];
    hadm_info_t *hadm_info_p = &hadm_meas_p->info;
    hadm_proc_t *hadm_proc = &hadm_procs[hadm_meas_p->config_p->connIdx];
    uint8_t mode0Nb = hadm_meas_p->config_p->mode0Nb;
    bool_t proc_agc_locked = (hadm_proc->agc_idx != 0xFF);
    bool_t subevent_synced = FALSE;

    hadm_sync_info_t *sync_info_p = &hadm_meas_p->sync_info[0];
    BLE_HADM_STATUS_t status;
    
    DEBUG_PIN1_SET

    for (step_idx = 0; step_idx < mode0Nb; step_idx++, sync_info_p++)
    {        
        if (sync_info_p->valid)
        {
            subevent_synced = TRUE;
            
            /* If procedure has not locked its AGC yet (didn't get a subevent with at least one valid mode0) */
            /* look for smallest gain amongst valid mode 0's */
            if (!proc_agc_locked && (hadm_proc->agc_idx > sync_info_p->agc_idx))
            {
                hadm_info_p->sync_step_id = step_idx;
                /* Record AGC index and keep the smallest */
                hadm_proc->agc_idx = sync_info_p->agc_idx;
                /* Record the estimated CFO and channel used for CFO estimation */
                hadm_proc->cfo = sync_info_p->cfo;
                hadm_proc->cfo_channel = step_config_p[step_idx].channel;
                /* Compute ppm based on measured CFO */
                hadm_proc->ppm = (int16_t)((hadm_proc->cfo * HADM_PPM_DIVIDER)/ ((int32_t)HADM_CHAN_NUM_TO_MHZ(hadm_proc->cfo_channel)));
            }
        }
    }
    
    if (subevent_synced)
    {
        /* Freeze AGC according to the index from the retained mode 0 */
        lcl_hal_xcvr_set_rxgain(hadm_proc->agc_idx);
        
        /* fallback to one shot RSSI */
        lcl_hal_xcvr_setup_rssi_continuous(false); 

        /* Compute CFO & time grid adjustment */
        if (hadm_meas_p->config_p->role == HADM_ROLE_INITIATOR)
        {
            if ((hadm_meas_p->debug_flags & HADM_DBG_FLG_CFO_COMP_DIS) == 0)
            {
#ifdef HADM_CFO_COMP_PER_STEP_VIA_FOM
                /* Enable FOM entry trigger for next step */
                LCL_HAL_ENABLE_FO_ENTRY();
                /* Compute CFO compensation to apply at next step */
                int32_t cfo;
                LCL_HAL_COMPUTE_CHANNEL_CFO(cfo, hadm_meas_p->config_p->chModePmAntMap[mode0Nb].channel, hadm_proc->ppm);
                lcl_hadm_apply_cfo_per_step(cfo);
#else
                /* Initial CFO compensation */
                XCVR_LCL_RsmCompCfo(-hadm_proc->cfo);
#endif /* HADM_CFO_COMP_PER_STEP_VIA_FOM */

#ifdef HADM_CFO_COMP_PER_STEP_VIA_PKTRAM
                /* Update CFO programmed for already-built config steps */
                /* At this point only 1 step has been prepared in addition of the mode 0 steps */
                hadm_circ_buff_desc_t *circ_buff_p = &hadm_meas_p->pkt_ram.step_result;
                int16_t step_cfo;
                step_idx = mode0Nb + 1U;

                LCL_HAL_COMPUTE_STEP_CFO(step_cfo, hadm_proc->cfo_channel, step_config_p[step_idx].channel, hadm_proc->ppm);
              
                circ_buff_p = &hadm_meas_p->pkt_ram.step_config;
                assert(circ_buff_p->curr_step_idx == step_idx);
                uint32_t *config_write_ptr = circ_buff_p->base_ptr + (mode0Nb * LCL_HAL_PKT_RAM_STEP_CONFIG_MODE0_SIZE); /* skip mode 0s */
                
                LCL_HAL_UPDATE_CFO_IN_PKT_RAM_CONFIG_STEP(config_write_ptr, step_cfo);
#endif
            }
            
            /* Program time-grid adjustment (Initiator only) */
            lcl_hal_xcvr_program_time_adjustement((int32_t)hadm_proc->ppm/HADM_PPM_DIVIDER);
        }
        else
        {   /* Reflector Only */
            /*
             * In some PKT-Tone cases, cfo_est may be activated (depends on received AA) for tones, affecting badly the phase.
             * To workaround this effect, we force cfo_est to zero by enabling ovveride.
             * Affected register XCVR_RX_DIG->CTRL1 is part of XCVR backup/restore.
             */
            LCL_HAL_SETUP_PKT_TONE_RX();
        }
        status = HADM_HAL_SUCCESS;
    }
    else
    {
        status = HADM_HAL_ABORTED_SYNC;
    }
    DEBUG_PIN1_CLR

    return status;
}

/*!
 * This function is used to read available subevent steps results from PKT RAM Results circular buffer
 * and format results directly in HCI format into hadm_result_buff_desc buffer.
 * This is called on RSM step interrupt IRQ or RSM EOS
 * RSM overflow is checked
 * if n_steps_required==0, all available results will be read
 */
static BLE_HADM_STATUS_t lcl_hadm_get_step_results(uint16 n_steps_required, hadm_meas_t *hadm_meas_p)
{
    hadm_circ_buff_desc_t *circ_buff_p = &hadm_meas_p->pkt_ram.step_result;
    BLE_HADM_Chan_Mode_PmExt_AntPerm_t *step_config_p = &hadm_meas_p->config_p->chModePmAntMap[circ_buff_p->curr_step_idx];
    hadm_info_t *hadm_info_p = &hadm_meas_p->info;
    hadm_proc_t *hadm_proc_p = &hadm_procs[hadm_meas_p->config_p->connIdx];
    uint8_t *res_buff_in_p;
    uint8_t *res_buff_p;
    uint8_t nb_steps = 0;
    uint8_t step_mode0_no = 0;
    uint8_t rtt_pkt_no = 0;
    BLE_HADM_role_t role = hadm_meas_p->config_p->role;

    uint32_t common_stat;
    uint32_t nadm_error_rssi;
    uint32_t rtt_data_raw;
    uint32_t tpm;  /* TPM timestamp unit is 1/32MHz */
    int ap;
    int32_t iq[HADM_MAX_NB_ANTENNA_PATHS+1U];
       
    assert(circ_buff_p->curr_step_idx < hadm_meas_p->config_p->stepsNb);
    
    if (circ_buff_p->curr_step_idx > 0)
    {
        hadm_meas_p->result_p = lcl_hadm_utils_get_result_buffer();
        
        if (hadm_meas_p->result_p == NULL)
        {
            assert(FALSE);
            return HADM_HAL_MEMORY_FULL;
        }
        hadm_meas_p->result_p->connIdx = hadm_meas_p->config_p->connIdx;
        hadm_meas_p->result_p->subeventIdx = hadm_meas_p->config_p->subeventIdx; /* echo subeventIdx */
    }
    DEBUG_PIN1_SET

    res_buff_in_p = hadm_meas_p->result_p->resultBuffer;
    res_buff_p = res_buff_in_p;
    hadm_meas_p->result_p->firstStepCollected = circ_buff_p->curr_step_idx;
    /* Copy CFO into frequencyCompensation from procedure if initiator (already set to fixed value otherwise) */
    if (role == HADM_ROLE_INITIATOR)
    {
        uint8_t *freq_comp_p = (uint8_t *)&hadm_meas_p->result_p->frequencyCompensation;
        HADM_SET_RTT_CFO(TRUE, hadm_proc_p->ppm, freq_comp_p);
    }

    /* Compute RPL once per subevent.*/
    if (hadm_meas_p->result_p->referencePwrLevel == HADM_INVALID_REFERENCE_POWER_LEVEL)
    {
        if (hadm_proc_p->agc_idx <= 11)
        {
            hadm_meas_p->result_p->referencePwrLevel = lcl_hal_xcvr_compute_rpl(hadm_proc_p->agc_idx);
        }
    }

    /* Prepare for NADM metric calculations */
    BLE_HADM_rttPhyMode_t rate = hadm_meas_p->config_p->rttPhy;
    uint8_t fm_corr_target;
    uint8_t fm_corr_div;
    XCVR_LCL_GetNadmMetricCalFactors((XCVR_RSM_SQTE_RATE_T)rate, (XCVR_RSM_RTT_TYPE_T)hadm_meas_p->config_p->rttTypes, fm_corr_target, fm_corr_div);
	
    while (circ_buff_p->curr_step_idx < hadm_meas_p->config_p->stepsNb)
    {
        if ((hadm_meas_p->pkt_ram.result_read_ptr + circ_buff_p->max_step_size) > circ_buff_p->base_ptr + circ_buff_p->buff_len)
        {
            /* Need to wrap now: rewind write pointer to start and toggle page */
            hadm_meas_p->pkt_ram.result_read_ptr = circ_buff_p->base_ptr;
            circ_buff_p->curr_page ^= 1U;
        }
        
        /* Decode common status */
        common_stat = *hadm_meas_p->pkt_ram.result_read_ptr++;
        assert(circ_buff_p->curr_step_idx == (common_stat & COM_RES_HDR_STEP_ID_STEP_ID_MASK)); /* HW and SW step_id should be aligned! */
        
