nxp-mcuxpresso/mcuxsdk-middleware-bluetooth-controller/src/hadm/kw47_mcxw72x_nbu/lcl_hadm_measurement.c
        if ((common_stat & 0x30000000U) != 0)
        {
            hadm_info_p->num_time_adj++; /* record time_adj for debug */
        }
        
        /* Decode packet status if present */
        if (step_config_p->mode != HADM_STEP_MODE2)
        {
            nadm_error_rssi = *hadm_meas_p->pkt_ram.result_read_ptr++;
            rtt_data_raw = *hadm_meas_p->pkt_ram.result_read_ptr;
            hadm_meas_p->pkt_ram.result_read_ptr += 2U; /* skip cfo_est */
            tpm = *hadm_meas_p->pkt_ram.result_read_ptr++;
#ifdef RTT_DEBUG
            rtt_tpm_dbg_buffer[circ_buff_p->curr_step_idx] = tpm;
            rtt_common_stat_dbg_buffer[circ_buff_p->curr_step_idx] = common_stat & 0x30000000U;
#endif
        }
        
         /* Decode tone status if present */
        if (step_config_p->mode >= HADM_STEP_MODE2)
        {
            for (ap = 0; ap <= hadm_meas_p->n_ap; ap++)
            {
                iq[ap] = *hadm_meas_p->pkt_ram.result_read_ptr++;
            }
        }       
        
        /* Store Step_Data "header" */
        *res_buff_p++ = step_config_p->mode; /* Step_Mode */
        *res_buff_p++ = step_config_p->channel; /* Step_Channel */
        
        /* Store Step_Data */
        switch (step_config_p->mode)
        {
            case HADM_STEP_MODE0:
            {
                static bool_t synch_done = FALSE;
                bool vld = hadm_meas_p->sync_info[step_mode0_no].valid;
                 /* (Hz*100) / MHz  => 0.01 ppm unit */
                int32_t ppm = (hadm_meas_p->sync_info[step_mode0_no].cfo * HADM_PPM_DIVIDER) / (int32_t)HADM_CHAN_NUM_TO_MHZ(step_config_p->channel);
                *res_buff_p++ = BLE_HADM_STEP0_REPORT_SIZE(role); /* Step_Data_Length */
                *res_buff_p++ = HADM_SET_RTT_AA_QUALITY(vld); /* Packet_AA_Quality */
                *res_buff_p++ = HADM_SET_RTT_RSSI(vld, hadm_meas_p->sync_info[step_mode0_no].rssi); /* Packet RSSI */
                *res_buff_p++ = hadm_meas_p->pkt_ram_data_in_flight[hadm_meas_p->data_in_flight_r_idx].cs_sync_ant_id + 1U;  /* Packet_Antenna (1 byte) */
                if (role == HADM_ROLE_INITIATOR)
                {
                    HADM_SET_RTT_CFO(vld, ppm, res_buff_p); /* Measured_Freq_Offset (2 bytes) */
                }
                if (!synch_done && vld)
                {
                    /* Compute final value for syncDelayUs which represents time starting from RSM trigger */
                    /* syncOffsetUs = HADM_HAL_RSM_TRIGGER_DELAY + TPM timestamp - pkt_header_duration - aa_match_delay */
                    hadm_meas_p->result_p->syncDelayUs = HADM_RTT_TS_TO_US(tpm);
                    assert((HADM_HAL_RSM_TRIGGER_DELAY + hadm_meas_p->result_p->syncDelayUs) > (HADM_1ST_BIT_TO_AA_MATCH_DURATION_US(hadm_meas_p->config_p->rttPhy)));
                    hadm_meas_p->result_p->syncDelayUs = hadm_meas_p->result_p->syncDelayUs + HADM_HAL_RSM_TRIGGER_DELAY - HADM_1ST_BIT_TO_AA_MATCH_DURATION_US(hadm_meas_p->config_p->rttPhy);
                    hadm_meas_p->result_p->syncDelayUs -= (step_mode0_no * hadm_meas_p->step_duration[0]); /* cope for missed mode0s */
                    synch_done = TRUE;
                }
                step_mode0_no++;
                rtt_pkt_no++;
                break;
            }
            case HADM_STEP_MODE1:
            case HADM_STEP_MODE3:
            {
                xcvr_lcl_rtt_data_t rtt_data;
                int32_t frac_delay = 0;
                int32_t rtt_ts = 0;
                uint8_t nadm_metric = 0xFF; /* NADM not available by default */
                rtt_pkt_no++;
                XCVR_LCL_UnpackRttResult((xcvr_lcl_rtt_data_raw_t *)&rtt_data_raw, &rtt_data, (XCVR_RSM_SQTE_RATE_T)rate); /* OJE TODO: optimize...*/
                if (rtt_data.rtt_vld && rtt_data.rtt_found)
                {
                    DEBUG_PIN1_SET
                    /* Compute integer and fractional adjustment in ns */
                    frac_delay = lcl_hadm_hartt_compute_fractional_delay((uint32_t)rate, hadm_meas_p->pkt_ram_data_in_flight[hadm_meas_p->data_in_flight_r_idx].aa_rx, rtt_data.p_delta, rtt_data.int_adj);
#ifdef RTT_DEBUG
                    rtt_frac_dbg_buffer[circ_buff_p->curr_step_idx] = frac_delay;
                    rtt_p_delta_dbg_buffer[circ_buff_p->curr_step_idx] = rtt_data.p_delta;
                    rtt_int_adj_dbg_buffer[circ_buff_p->curr_step_idx] = rtt_data.int_adj;
#endif
                    if (role == HADM_ROLE_REFLECTOR)
                    {
                        frac_delay = -frac_delay; /* On reflector side, substract frac delay */
                    }
                    DEBUG_PIN1_CLR              

                    rtt_ts = HADM_RTT_TS_TO_NS(tpm) * 2U; /* in half ns */
                    rtt_ts = rtt_ts - hadm_meas_p->ts_delay_hns + frac_delay*2U; /* in half ns to keep ts_delay_hns precision */
                    if ((step_config_p->mode == HADM_STEP_MODE3) && ((step_config_p->pm_ext & 0x1) != 0))
                    {
                        /* Remove an extra T_PM + T_SW in mode 3 case if required */
                        rtt_ts -= hadm_meas_p->ts_extra_delay_hns;
                    }
                    if ((rtt_ts < -32768) || (rtt_ts > 32767)) 
                    {
#ifndef SIMULATOR
                        //assert(false);
#endif
                        //rtt_data.rtt_vld = false;
                        rtt_ts = 12345; /* OJE TODO */
                    }
                    if (hadm_meas_p->config_p->rttTypes != HADM_RTT_TYPE_CS_AA_ONLY_TIMING)
                    {
                        uint32_t nadm_fm_corr_value = ((nadm_error_rssi & COM_MODE_013_RES_BODY_NADM_ERROR_RSSI_RAW_NADM_FM_CORR_VALUE_MASK)>>COM_MODE_013_RES_BODY_NADM_ERROR_RSSI_RAW_NADM_FM_CORR_VALUE_SHIFT);
                        XCVR_LCL_CalcNadmMetric(nadm_fm_corr_value, fm_corr_target, fm_corr_div, nadm_metric);
                    }
                }
                if (step_config_p->mode == HADM_STEP_MODE1)
                {
                    *res_buff_p++ = BLE_HADM_STEP1_REPORT_SIZE; /* Step_Data_Length */
                }
                else
                {
                    *res_buff_p++ = BLE_HADM_STEP3_REPORT_SIZE(hadm_meas_p->n_ap); /* Step_Data_Length */
                }
                *res_buff_p++ = (HADM_SET_RTT_AA_QUALITY(rtt_data.rtt_vld)); /* Packet_AA_Quality (1 byte) */
                *res_buff_p++ = nadm_metric; /* Packet_NADM */
                *res_buff_p++ = HADM_SET_RTT_RSSI(rtt_data.rtt_vld, (uint8_t)(nadm_error_rssi & COM_MODE_013_RES_BODY_NADM_ERROR_RSSI_RSSI_NB_MASK)); /* Packet_RSSI (1 byte) */
                HADM_SET_RTT_TS_DIFF(rtt_data.rtt_vld, rtt_ts, res_buff_p); /* ToX-ToX time diff (2 bytes) */
                *res_buff_p++ = hadm_meas_p->pkt_ram_data_in_flight[hadm_meas_p->data_in_flight_r_idx].cs_sync_ant_id + 1U;  /* Packet_Antenna (1 byte) */

                if (step_config_p->mode == HADM_STEP_MODE1)
                {
                    break;
                }
                /* else mode 3, do not break: intentional drop trough */
            }
            case HADM_STEP_MODE2:
            {
                /* Keep pm extension bit corresponding to peer device role */
                uint8_t t_pm_ext = (step_config_p->pm_ext >> role) & 0x1U;
                if (step_config_p->mode == HADM_STEP_MODE2)
                {
                    *res_buff_p++ = BLE_HADM_STEP2_REPORT_SIZE(hadm_meas_p->n_ap); /* Step_Data_Length */
                }
                *res_buff_p++ = step_config_p->ant_perm; /* Antenna_Permutation_Index */
                /* Store PCT[ap], 3 bytes each 22 significant bits  +  Tone Quality Indicator [ap] (1 byte each) */
                for(ap = 0; ap < hadm_meas_p->n_ap; ap++)
                {
                    HADM_SET_RTP_PCT(iq[ap], res_buff_p);
                    HADM_SET_RTP_TONE_QUALITY(iq[ap], res_buff_p, false, 0);
                }
                /* Determine if N_AP+1 PCT has been received or not */
                if ((step_config_p->mode == HADM_STEP_MODE2) || (role == HADM_ROLE_REFLECTOR) || ((step_config_p->pm_ext & 0x1) != 0))
                {
                    HADM_SET_RTP_PCT(iq[ap], res_buff_p);
                    HADM_SET_RTP_TONE_QUALITY(iq[ap], res_buff_p, true, t_pm_ext);
                }
                else
                {
                    /* Extension slot for Mode 3 initiator does not exist in case DRBG pm_ext is 0.
                     * The reason is that even though the PM extension duration is always part of the overall step duration,
                     * this is a dummy period with no RX activity.
                     */
                    HADM_SET_RTP_PCT(0, res_buff_p);
                    HADM_SET_RTP_TONE_QUALITY(0x3, res_buff_p, false, 0);
                }
                break;
            }
            default:
                assert(FALSE);
                break;
        }
        
