nxp-mcuxpresso/mcuxsdk-middleware-bluetooth-controller/src/hadm/kw47_mcxw72x_nbu/lcl_hadm_measurement.c
        if (step_config_p->mode != HADM_STEP_MODE2)
        {
            if (++hadm_meas_p->data_in_flight_r_idx >= HADM_HAL_PKT_RAM_IN_FLIGHT_DATA_BUFFER_SIZE)
            {
                hadm_meas_p->data_in_flight_r_idx = 0;
            }
        }
        circ_buff_p->curr_step_idx++;
        step_config_p++;
        nb_steps++;
        
        if (nb_steps == n_steps_required)
        {
            break;
        }
    }
    
    hadm_meas_p->result_p->nbStepsCollected = nb_steps;
    assert((res_buff_p - res_buff_in_p) <= hadm_meas_p->result_p->resultBufferSize); /* check we did not write out of bounds */
    
    LCL_HAL_UPDATE_PKT_RAM_RESULT_STEP_PTR(circ_buff_p->curr_page, hadm_meas_p->pkt_ram.result_read_ptr);
    
    DEBUG_PIN1_CLR

    return HADM_HAL_SUCCESS;
}

/* RSM_INT_IRQ Handler */
void RSM_INT_IRQHandler(void)
{
    BLE_HADM_event_type_t type = HADM_EVENT_INVALID;
    uint32_t irq_status = LCL_HAL_RSM_GET_IRQ_STATUS_FLAGS;
    BLE_HADM_STATUS_t hal_status = HADM_HAL_SUCCESS;
    hadm_meas_t *hadm_meas_p = hadm_device.active_meas_p;
    
    DEBUG_PIN0_SET

    assert(hadm_meas_p != NULL);
    assert(hadm_meas_p->config_p != NULL);
    assert(hadm_meas_p->result_p != NULL);
    assert((hadm_meas_p->state == HADM_HAL_MEAS_STATE_RUNNING) || (hadm_meas_p->state == HADM_HAL_MEAS_STATE_ABORTING));

    if (hadm_meas_p->state == HADM_HAL_MEAS_STATE_ABORTING)
    {
        /* Aborted by user */
        type = HADM_EVENT_EOS;
        hal_status = HADM_HAL_STOPPED;
    }
    else if (irq_status & LCL_HAL_XCVR_RSM_IRQ_ABORT)
    {
        /* RSM has aborted */
        type = HADM_EVENT_EOS;
        uint32_t abort_reason = XCVR_MISC->RSM_CSR & (XCVR_MISC_RSM_CSR_RSM_PLL_ABORT_MASK | XCVR_MISC_RSM_CSR_RSM_UNDR_ERR_MASK | XCVR_MISC_RSM_CSR_RSM_OVF_ERR_MASK | XCVR_MISC_RSM_CSR_RSM_TIMEOUT0_ABORT_MASK);
        
        if (abort_reason & XCVR_MISC_RSM_CSR_RSM_TIMEOUT0_ABORT_MASK)
        {
            hal_status = HADM_HAL_ABORTED_SYNC;
        }
        else if ((abort_reason & XCVR_MISC_RSM_CSR_RSM_UNDR_ERR_MASK) &&
                 (hadm_meas->info.sync_step_id == 0xFF))
        {
            /* KW47 HW bug workaround on reflector: when mode0 retry is enabled, there's a small
             * probability that the RSM does not send an abort IRQ in case the last mode0 is
             * received (AA match) just after transitioning to 1st non_mode0 step.
             * In this case, the condition is detected by an RSM underrun on 2nd non-mode0 step.
             * This situation should be avoided by the LL ensuring that mode0 timeout
             * is only enabled when devices are properly synchronized (small window widening).
             * Note: when this occurs there's a dummy transmission for the 1st non-mode0 step.
             */
            hal_status = HADM_HAL_ABORTED_SYNC;
        }
        else  /* should not occur */
        {
            assert(FALSE);
            hal_status = HADM_HAL_ABORTED;
        }
    }
    else if (irq_status & LCL_HAL_XCVR_RSM_IRQ_EOS)
    {
        /* End Of Sequence */
        type = HADM_EVENT_EOS;

        /* Pull remaining steps results */
        if (hadm_meas_p->pkt_ram.step_result.curr_step_idx < hadm_meas_p->config_p->stepsNb)
        {
            hal_status = lcl_hadm_get_step_results(0, hadm_meas_p);
            assert(hadm_meas_p->data_in_flight_w_idx == hadm_meas_p->data_in_flight_r_idx);
        }
    }
    else
    {
        if (irq_status & LCL_HAL_XCVR_RSM_IRQ_FM)
        {
            /* Mode 0 interrupt */
            hadm_circ_buff_desc_t *circ_buff_p = &hadm_meas_p->pkt_ram.step_result;
            uint32_t *rsm_result_ptr;
            bool_t aa_det;
            bool_t mode0_index = circ_buff_p->curr_step_idx;
            
            do
            {
                rsm_result_ptr = circ_buff_p->base_ptr + (mode0_index * LCL_HAL_PKT_RAM_STEP_RESULT_MODE01_SIZE);
                aa_det = lcl_hal_xcvr_decode_mode0_step(hadm_meas_p->sync_info, rsm_result_ptr, (uint8_t)hadm_meas_p->config_p->rttPhy);
                mode0_index++;
            } while ((hadm_meas_p->config_p->role == HADM_ROLE_REFLECTOR) && (aa_det == FALSE) && (circ_buff_p->curr_step_idx == 0)); /* first mode 0 was missed, go to next */
            circ_buff_p->curr_step_idx = mode0_index;

            if (circ_buff_p->curr_step_idx == hadm_meas_p->config_p->mode0Nb)
            {
                /* Last mode 0 has been received */
                hal_status = lcl_hadm_handle_last_mode0(hadm_meas_p);

                if (hal_status != HADM_HAL_SUCCESS)
                {
                    type = HADM_EVENT_EOS;
                    /* Abort Subevent */
                    lcl_hadm_measurement_shutdown(hadm_meas_p, TRUE);
                }
                else
                {
                    type = HADM_EVENT_SYNC_DONE;
                    if (hadm_meas_p->pkt_ram.step_config.curr_step_idx < hadm_meas_p->config_p->stepsNb)
                    {
                        /* Push more config steps if needed */
                        lcl_hadm_set_steps_config(hadm_meas_p->pkt_ram.nb_steps_before_irq + HADM_HAL_PKT_RAM_NB_STEPS_MARGIN, hadm_meas_p, TRUE);
                    }
                }
                circ_buff_p->curr_step_idx = 0; /* reset current read index to process results in next step interrupt */
            }
        }
        else if (irq_status & LCL_HAL_XCVR_RSM_IRQ_STEP)
        {
            /* Step interrupt */
            if (hadm_meas_p->pkt_ram.step_config.curr_step_idx < hadm_meas_p->config_p->stepsNb)
            {
                /* Push more config steps if needed */
                lcl_hadm_set_steps_config(hadm_meas_p->pkt_ram.nb_steps_before_irq, hadm_meas_p, TRUE);
            }
            
            /* Read available step results */
            hal_status = lcl_hadm_get_step_results(hadm_meas_p->pkt_ram.nb_steps_before_irq, hadm_meas_p);
            if (hal_status == HADM_HAL_SUCCESS)
            {
                type = HADM_EVENT_STEP_INT;
            }
            else
            {
                assert(false);
                type = HADM_EVENT_EOS;
            }
            hadm_meas_p->pkt_ram.nb_irq_steps_handled++;
        }
    }

    if (type == HADM_EVENT_EOS)
    {
        /* Stop or abort Subevent */
        lcl_hadm_measurement_shutdown(hadm_meas_p, hal_status != HADM_HAL_SUCCESS);
        
         /* Perform post-capture remaining actions:
         *   - Populate hadm_info fields related to mode 0
         *   - Populate debug flags
         */
        hadm_proc_t *hadm_proc_p = &hadm_procs[hadm_meas_p->config_p->connIdx];
        hadm_info_t *hadm_info_p = &hadm_meas_p->info;
        if (hadm_info_p->sync_step_id < HADM_MAX_NB_STEPS_MODE0) 
        {
            hadm_sync_info_t *sync_info_p = &hadm_meas_p->sync_info[hadm_info_p->sync_step_id];
            hadm_info_p->sync_rssi = sync_info_p->rssi;
            hadm_info_p->sync_cfo = hadm_proc_p->cfo;
            hadm_info_p->sync_rxgain = hadm_proc_p->agc_idx;
        }

        if (hadm_proc_p->agc_idx > LCL_HAL_XCVR_AGC_INDEX_MAX)
            hadm_info_p->flags |= FLAGS_HADM_AGC_NOT_FROZEN;

        if (hadm_info_p->sync_rssi < -93)
            hadm_info_p->flags |= FLAGS_HADM_NO_SIGNAL;
        
        if (hal_status == HADM_HAL_ABORTED_SYNC)
            hadm_info_p->flags |= FLAGS_HADM_SYNC_ERROR;
        else if (hal_status == HADM_HAL_ABORTED)
            hadm_info_p->flags |= FLAGS_HADM_ABORT;
    }
    
    if (((hadm_meas_p->debug_flags & HADM_DBG_FLG_DBG_INFO) != 0) &&
        (hadm_meas_p->pkt_ram.step_result.curr_step_idx == hadm_meas_p->config_p->stepsNb))
    {
        /* On KW47, just report hadm_info_t for debug. Done in the last reported event. */
        hadm_meas_p->result_p->debugBuffer = (uint8_t *)&hadm_meas_p->info;
        hadm_meas_p->result_p->debugBufferSize = sizeof(hadm_info_t);
    }

